Week_6/sandwich/sandwichr-master/app/controllers/sandwiches_controller.rb

	def index
	  sandwiches = Sandwich.all
---
SELECT "sandwiches".* FROM "sandwiches"

	def create
	  sandwich = Sandwich.create(sandwich_params)
---
INSERT INTO "sandwiches" ("name", "bread_type", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "classic"], ["bread_type", "white bread"], ["created_at", "2016-07-18 13:40:15.818215"], ["updated_at", "2016-07-18 13:40:15.818215"]]

	def add_ingredients
		sandwich = Sandwich.find_by(id: params[:id])
		ingredient = Ingredient.find_by(id: params[:ingredient])
---
SELECT  "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT 1  [["id", 1]]

	def show
	  sandwich = Sandwich.find_by(id: params[:id])
---
SELECT  "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = ? LIMIT 1  [["id", 1]]

	def ingredients
		@sandwich = Sandwich.find_by(id: params[:id])
		@ingredients = Ingredient.all
---
SELECT  "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = ? LIMIT 1  [["id", 1]]
SELECT "ingredients".* FROM "ingredients"