Week_6/Day_1/sandwich/sandwichr-master/app/controllers/sandwich_views_controller.rb

  def index
    @sandwiches = Sandwich.all
---
SELECT "sandwiches".* FROM "sandwiches"

  def show
    @sandwich = Sandwich.find_by(id: params[:id])
    @ingredients = Ingredient.all
---
SELECT  "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = ? LIMIT 1  [["id", 1]]
SELECT "ingredients".* FROM "ingredients"