Week_6/Day_1/sandwich/sandwichr-master/app/views/sandwiches/ingredients.html.erb

<ul>
<%@sandwich.ingredients.each do |ingredient|%>
---
SELECT "ingredients".* FROM "ingredients" INNER JOIN "sandwich_ingredients" ON "ingredients"."id" = "sandwich_ingredients"."ingredient_id" WHERE "sandwich_ingredients"."sandwich_id" = ?  [["sandwich_id", 1]]